
{
  "nodes": [
    { "label": "Gabriel García Márquez", "type": "author", "description": "Colombian novelist, a leading figure of the Magical Realism movement." },
    { "label": "One Hundred Years of Solitude", "type": "book", "publicationYear": 1967, "description": "A multi-generational story of the Buendía family, whose patriarch founds the town of Macondo." },
    { "label": "Isabel Allende", "type": "author", "description": "Chilean writer whose works often contain aspects of the magical realist tradition." },
    { "label": "The House of the Spirits", "type": "book", "publicationYear": 1982, "description": "Details the life of the Trueba family in a sweeping family saga." },
    { "label": "Salman Rushdie", "type": "author", "description": "British-American novelist whose work combines magical realism with historical fiction." },
    { "label": "Midnight's Children", "type": "book", "publicationYear": 1981, "description": "Deals with India's transition from British colonialism to independence, linked by telepathic children." },
    { "label": "Haruki Murakami", "type": "author", "description": "Japanese writer whose work blends the mundane with the surreal and fantastical." },
    { "label": "Kafka on the Shore", "type": "book", "publicationYear": 2002, "description": "An intricate novel with two distinct but interrelated plots, featuring talking cats and fish falling from the sky." },
    { "label": "Jorge Luis Borges", "type": "author", "description": "Argentine short-story writer, a key figure in Spanish-language literature and a precursor to magical realism." },
    { "label": "Ficciones", "type": "book", "publicationYear": 1944, "description": "A collection of short stories exploring themes of labyrinths, dreams, and infinity." },
    { "label": "Laura Esquivel", "type": "author", "description": "Mexican novelist known for her use of magical realism in the context of cooking and romance." },
    { "label": "Like Water for Chocolate", "type": "book", "publicationYear": 1989, "description": "A novel where the protagonist's emotions are infused into the food she cooks, affecting those who eat it." },
    { "label": "Toni Morrison", "type": "author", "description": "American novelist whose works often feature elements of myth, magic, and the supernatural in African-American history." },
    { "label": "Beloved", "type": "book", "publicationYear": 1987, "description": "A novel inspired by the story of an enslaved African-American woman, Margaret Garner, exploring the haunting legacy of slavery." },
    { "label": "Julio Cortázar", "type": "author", "description": "An Argentine-French novelist, one of the founders of the Latin American Boom." },
    { "label": "Hopscotch", "type": "book", "publicationYear": 1963, "description": "An experimental novel that can be read in multiple sequences, challenging the traditional linear narrative." },
    { "label": "Günter Grass", "type": "author", "description": "German novelist and Nobel laureate whose work often incorporates fantastical elements." },
    { "label": "The Tin Drum", "type": "book", "publicationYear": 1959, "description": "The story of Oskar Matzerath, who decides to stop growing at age three, told from his unique perspective." },
    { "label": "Angela Carter", "type": "author", "description": "English novelist known for her feminist, magical realism, and picaresque works." },
    { "label": "Nights at the Circus", "type": "book", "publicationYear": 1984, "description": "A story of a winged circus performer in the 19th century, blending fantasy and reality." },
    { "label": "Mikhail Bulgakov", "type": "author", "description": "Russian writer whose work satirized Soviet society with surreal and fantastical elements." },
    { "label": "The Master and Margarita", "type": "book", "publicationYear": 1967, "description": "A novel that intertwines the Devil's visit to Moscow with the story of Pontius Pilate and Jesus Christ." },
    { "label": "Alejo Carpentier", "type": "author", "description": "A Cuban novelist who profoundly influenced Latin American literature, coining the term 'lo real maravilloso' (the marvelous real)." },
    { "label": "The Kingdom of this World", "type": "book", "publicationYear": 1949, "description": "A novel about the Haitian Revolution, blending history with Afro-Caribbean mythology and folklore." },
    { "label": "Miguel Ángel Asturias", "type": "author", "description": "A Guatemalan Nobel laureate whose work was deeply influenced by Mayan mythology." },
    { "label": "Men of Maize", "type": "book", "publicationYear": 1949, "description": "A novel that explores the conflict between indigenous traditions and modernizing forces in Guatemala." },
    { "label": "Ben Okri", "type": "author", "description": "A Nigerian poet and novelist who uses magical realism to explore post-colonial themes." },
    { "label": "The Famished Road", "type": "book", "publicationYear": 1991, "description": "The story of Azaro, a spirit-child, navigating the harsh realities of life in Nigeria." },
    { "label": "Yasunari Kawabata", "type": "author", "description": "A Japanese novelist and the first Japanese author to receive the Nobel Prize in Literature." },
    { "label": "Palm-of-the-Hand Stories", "type": "book", "publicationYear": 1988, "description": "A collection of very short stories that often blend reality with dreamlike and surreal imagery." },
    { "label": "Milan Kundera", "type": "author", "description": "A Czech-born French writer whose novels often weave together philosophical reflection with a touch of the absurd and surreal." },
    { "label": "The Unbearable Lightness of Being", "type": "book", "publicationYear": 1984, "description": "A novel about two women, two men, a dog, and their lives in the 1968 Prague Spring." },
    { "label": "Mo Yan", "type": "author", "description": "A Chinese novelist and Nobel laureate known for his 'hallucinatory realism'." },
    { "label": "Red Sorghum", "type": "book", "publicationYear": 1986, "description": "A family saga set in a rural part of China during the Second Sino-Japanese War." },
    { "label": "Italo Calvino", "type": "author", "description": "An Italian writer whose work often takes the form of fables and explores fantastical possibilities." },
    { "label": "Invisible Cities", "type": "book", "publicationYear": 1972, "description": "A novel structured as a conversation between Marco Polo and Kublai Khan, describing 55 fantastical cities." },
    { "label": "Alice Hoffman", "type": "author", "description": "American novelist known for weaving magic and the supernatural into contemporary settings." },
    { "label": "Practical Magic", "type": "book", "publicationYear": 1995, "description": "A story about two witch sisters who must use their powers to overcome a family curse." },
    { "label": "Sarah Addison Allen", "type": "author", "description": "American author whose novels are often set in the Southern United States and feature magical elements." },
    { "label": "Garden Spells", "type": "book", "publicationYear": 2007, "description": "A story of the Waverley family, whose magical apple tree bears fruit with special properties." },
    { "label": "Aimee Bender", "type": "author", "description": "An American writer known for her surrealist, fairytale-like short stories and novels." },
    { "label": "The Particular Sadness of Lemon Cake", "type": "book", "publicationYear": 2010, "description": "A novel about a young girl who can taste the emotions of the person who prepared her food." },
    { "label": "Helen Oyeyemi", "type": "author", "description": "A British novelist whose work often reinterprets fairy tales with a modern, surreal twist." },
    { "label": "Boy, Snow, Bird", "type": "book", "publicationYear": 2014, "description": "A retelling of Snow White set in 1950s America, exploring themes of race and identity." },
    { "label": "Nnedi Okorafor", "type": "author", "description": "A Nigerian-American writer of science fiction and fantasy, often blending Africanfuturism with magical elements." },
    { "label": "Who Fears Death", "type": "book", "publicationYear": 2010, "description": "A post-apocalyptic novel set in Sudan, following a young woman with magical powers." },
    { "label": "Kelly Link", "type": "author", "description": "An American author of speculative fiction and magical realism short stories." },
    { "label": "Get in Trouble", "type": "book", "publicationYear": 2015, "description": "A collection of short stories that blend the mundane with the fantastic and surreal." },
    { "label": "Carmen Maria Machado", "type": "author", "description": "An American writer whose work often incorporates elements of horror, fantasy, and magical realism." },
    { "label": "Her Body and Other Parties", "type": "book", "publicationYear": 2017, "description": "A collection of short stories that uses fabulism to explore the realities of women's lives." },
    { "label": "Kazuo Ishiguro", "type": "author", "description": "A British novelist and Nobel laureate whose works often have a subtle, unsettling sense of unreality." },
    { "label": "The Buried Giant", "type": "book", "publicationYear": 2015, "description": "A fantasy novel set in Arthurian Britain, where a strange mist causes mass amnesia." },
    { "label": "Lesley Nneka Arimah", "type": "author", "description": "A Nigerian writer whose short stories blend magical realism with Nigerian folklore." },
    { "label": "What It Means When a Man Falls from the Sky", "type": "book", "publicationYear": 2017, "description": "A collection of stories that explore the lives of Nigerian women through a fabulist lens." },
    { "label": "Silvia Moreno-Garcia", "type": "author", "description": "A Mexican-Canadian author who often blends genres, including fantasy, horror, and magical realism." },
    { "label": "Mexican Gothic", "type": "book", "publicationYear": 2020, "description": "A gothic horror novel set in 1950s Mexico, featuring a remote mansion with a dark secret." },
    { "label": "Jeanette Winterson", "type": "author", "description": "A British writer whose novels often blend reality with myth, fairytale, and history." },
    { "label": "The Passion", "type": "book", "publicationYear": 1987, "description": "A historical novel set during the Napoleonic Wars, featuring a web-footed Venetian woman." },
    { "label": "Erin Morgenstern", "type": "author", "description": "An American author known for her fantastical and magical novels." },
    { "label": "The Night Circus", "type": "book", "publicationYear": 2011, "description": "A fantasy novel about a magical competition between two young illusionists." },
    { "label": "Tea Obreht", "type": "author", "description": "A Serbian-American novelist whose work incorporates folklore and myth." },
    { "label": "The Tiger's Wife", "type": "book", "publicationYear": 2011, "description": "A novel that weaves together the story of a young doctor in the Balkans with the myths her grandfather told her." },
    { "label": "Yoko Ogawa", "type": "author", "description": "A Japanese writer whose work often has a surreal, dreamlike quality." },
    { "label": "The Housekeeper and the Professor", "type": "book", "publicationYear": 2003, "description": "A novel about a brilliant mathematician whose memory only lasts for eighty minutes." },
    { "label": "Patrick Süskind", "type": "author", "description": "A German writer and screenwriter, known for his fantastical and obsessive characters." },
    { "label": "Perfume: The Story of a Murderer", "type": "book", "publicationYear": 1985, "description": "A historical fantasy novel about a man with an exceptional sense of smell who attempts to create the world's finest perfume." },
    { "label": "Jonathan Safran Foer", "type": "author", "description": "An American novelist known for his experimental and emotionally resonant work." },
    { "label": "Everything Is Illuminated", "type": "book", "publicationYear": 2002, "description": "A novel that tells the story of a young Jewish-American man who goes to Ukraine to find the woman who saved his grandfather from the Nazis." },
    { "label": "Mark Helprin", "type": "author", "description": "An American novelist and journalist, known for his fantastical and epic narratives." },
    { "label": "Winter's Tale", "type": "book", "publicationYear": 1983, "description": "A fantasy novel set in a mythical version of New York City." },
    { "label": "Karen Russell", "type": "author", "description": "An American novelist and short story writer, known for her surreal and imaginative stories set in Florida." },
    { "label": "Swamplandia!", "type": "book", "publicationYear": 2011, "description": "A novel about a family of alligator wrestlers in the Florida Everglades." },
    { "label": "China Miéville", "type": "author", "description": "An English fantasy fiction author, associated with the 'New Weird' genre." },
    { "label": "Perdido Street Station", "type": "book", "publicationYear": 2000, "description": "A fantasy novel set in the sprawling, steampunk city of New Crobuzon." },
    { "label": "Jeff VanderMeer", "type": "author", "description": "An American author, editor, and literary critic, known for his work in the New Weird genre." },
    { "label": "Annihilation", "type": "book", "publicationYear": 2014, "description": "The first book in the Southern Reach Trilogy, about a team of scientists who enter a mysterious, quarantined zone." },
    { "label": "Neil Gaiman", "type": "author", "description": "An English author of short fiction, novels, comic books, graphic novels, nonfiction, audio theatre, and films." },
    { "label": "American Gods", "type": "book", "publicationYear": 2001, "description": "A fantasy novel that blends Americana, fantasy, and various strands of ancient and modern mythology." },
    { "label": "Susanna Clarke", "type": "author", "description": "An English author known for her debut novel Jonathan Strange & Mr Norrell." },
    { "label": "Jonathan Strange & Mr Norrell", "type": "book", "publicationYear": 2004, "description": "An alternative history set in 19th-century England, where magic has returned." },
    { "label": "N. K. Jemisin", "type": "author", "description": "An American science fiction and fantasy writer." },
    { "label": "The Fifth Season", "type": "book", "publicationYear": 2015, "description": "A science fantasy novel set on a planet with a single supercontinent that suffers from catastrophic climate change every few centuries." },
    { "label": "Ursula K. Le Guin", "type": "author", "description": "An American author known for her works of speculative fiction, including science fiction works set in her Hainish universe, and the Earthsea fantasy series." },
    { "label": "A Wizard of Earthsea", "type": "book", "publicationYear": 1968, "description": "A fantasy novel that is the first of the Earthsea series, following a young wizard named Ged." },
    { "label": "Carlos Fuentes", "type": "author", "description": "A Mexican novelist and essayist, and one of the most admired writers in the Spanish-speaking world." },
    { "label": "The Death of Artemio Cruz", "type": "book", "publicationYear": 1962, "description": "A novel that portrays the life of a dying Mexican tycoon, reflecting on his past and the history of modern Mexico." },
    { "label": "Mario Vargas Llosa", "type": "author", "description": "A Peruvian novelist, journalist, essayist, and former politician, who is one of Latin America's most significant novelists and a Nobel laureate." },
    { "label": "Aunt Julia and the Scriptwriter", "type": "book", "publicationYear": 1977, "description": "A semi-autobiographical novel based on the author's own life, about a young writer and his relationship with his aunt and a radio scriptwriter." },
    { "label": "José Saramago", "type": "author", "description": "A Portuguese writer and recipient of the 1998 Nobel Prize in Literature." },
    { "label": "Blindness", "type": "book", "publicationYear": 1995, "description": "A novel about a mass epidemic of blindness that plagues an unnamed city." },
    { "label": "W. G. Sebald", "type": "author", "description": "A German writer and academic whose works blend fiction, history, and travelogue." },
    { "label": "The Emigrants", "type": "book", "publicationYear": 1992, "description": "A novel that tells the stories of four German emigrants, blurring the line between fact and fiction." },
    { "label": "Olga Tokarczuk", "type": "author", "description": "A Polish writer and activist, and a Nobel laureate, whose work often explores myth, history, and folklore." },
    { "label": "Flights", "type": "book", "publicationYear": 2007, "description": "A fragmentary novel that meditates on travel and human anatomy." },
    { "label": "Juan Rulfo", "type": "author", "description": "A Mexican writer, screenwriter, and photographer, known for his two seminal works, 'El Llano en llamas' and the novel 'Pedro Páramo'." },
    { "label": "Pedro Páramo", "type": "book", "publicationYear": 1955, "description": "A short novel that tells the story of a man who travels to his mother's hometown to find his father, only to find a town populated by ghosts." },
    { "label": "Clarice Lispector", "type": "author", "description": "A Brazilian novelist and short story writer, known for her innovative and existentialist works." },
    { "label": "The Hour of the Star", "type": "book", "publicationYear": 1977, "description": "A novel about a poor, uneducated woman in Rio de Janeiro, exploring themes of poverty, identity, and existence." },
    { "label": "Ngũgĩ wa Thiong'o", "type": "author", "description": "A Kenyan writer and academic who writes primarily in Gikuyu." },
    { "label": "Wizard of the Crow", "type": "book", "publicationYear": 2006, "description": "A satirical novel set in a fictional African country, exploring themes of politics, corruption, and power." },
    { "label": "Amos Tutuola", "type": "author", "description": "A Nigerian writer who wrote in English. He is best known for his novel The Palm-Wine Drinkard." },
    { "label": "The Palm-Wine Drinkard", "type": "book", "publicationYear": 1952, "description": "A novel that follows a man who journeys to the land of the dead to find his deceased palm-wine tapster." },
    { "label": "Ismail Kadare", "type": "author", "description": "An Albanian novelist, poet, essayist, and playwright." },
    { "label": "The Palace of Dreams", "type": "book", "publicationYear": 1981, "description": "A novel set in the Ottoman Empire, about a bureaucratic institution that collects and interprets the dreams of the empire's citizens." },
    { "label": "William Faulkner", "type": "author", "description": "An American writer and Nobel Prize laureate from Oxford, Mississippi. Faulkner wrote novels, short stories, screenplays, poetry, essays, and a play." },
    { "label": "As I Lay Dying", "type": "book", "publicationYear": 1930, "description": "A 1930 novel in the stream of consciousness style by William Faulkner." },
    { "label": "Eowyn Ivey", "type": "author", "description": "An American author known for her novels set in Alaska, which often incorporate elements of fairy tales." },
    { "label": "The Snow Child", "type": "book", "publicationYear": 2012, "description": "A novel based on a Russian fairy tale, about a childless couple in Alaska who build a child out of snow." },
    { "label": "Alix E. Harrow", "type": "author", "description": "An American writer of science fiction and fantasy." },
    { "label": "The Ten Thousand Doors of January", "type": "book", "publicationYear": 2019, "description": "A fantasy novel about a young woman who discovers a mysterious book that leads her to a world of magic and adventure." },
    { "label": "Shaun Tan", "type": "author", "description": "An Australian artist, writer and film maker. He won an Academy Award for The Lost Thing, a 2011 animated film adaptation of a 2000 picture book of the same name." },
    { "label": "The Arrival", "type": "book", "publicationYear": 2006, "description": "A wordless graphic novel that depicts the story of an immigrant in a surreal, dreamlike city." },
    { "label": "Andrei Bely", "type": "author", "description": "A Russian novelist, Symbolist poet, and literary theorist." },
    { "label": "Petersburg", "type": "book", "publicationYear": 1913, "description": "A modernist novel that is considered a masterpiece of Symbolist prose." },
    { "label": "Alfred Kubin", "type": "author", "description": "An Austrian printmaker, illustrator, and occasional writer. Kubin is considered an important representative of Symbolism and Expressionism." },
    { "label": "The Other Side", "type": "book", "publicationYear": 1909, "description": "A fantastical novel about a dream kingdom that becomes a nightmare." },
    { "label": "Leonora Carrington", "type": "author", "description": "A British-born surrealist painter, novelist, and short story writer." },
    { "label": "The Hearing Trumpet", "type": "book", "publicationYear": 1974, "description": "A surrealist novel about a 92-year-old woman who is sent to a mysterious retirement home." },
    { "label": "Zakes Mda", "type": "author", "description": "A South African writer, painter, and music composer." },
    { "label": "Ways of Dying", "type": "book", "publicationYear": 1995, "description": "A novel about a professional mourner in a violent South African township." },
    { "label": "Kōbō Abe", "type": "author", "description": "A Japanese writer, playwright, photographer, and inventor." },
    { "label": "The Woman in the Dunes", "type": "book", "publicationYear": 1962, "description": "An allegorical novel about a man who is trapped in a sand pit with a mysterious woman." },
    { "label": "José Donoso", "type": "author", "description": "A Chilean writer, journalist and professor. He lived most of his life in Chile, although he spent many years in self-imposed exile in Mexico, the United States and Spain." },
    { "label": "The Obscene Bird of Night", "type": "book", "publicationYear": 1970, "description": "A complex and challenging novel that is considered a masterpiece of the Latin American Boom." },
    { "label": "Adolfo Bioy Casares", "type": "author", "description": "An Argentine fiction writer, journalist, and translator." },
    { "label": "The Invention of Morel", "type": "book", "publicationYear": 1940, "description": "A science fiction novel about a fugitive who discovers a mysterious island where a group of people seem to be living in a perpetual loop." },
    { "label": "César Aira", "type": "author", "description": "An Argentine writer and translator, and an important figure in contemporary Latin American literature." },
    { "label": "An Episode in the Life of a Landscape Painter", "type": "book", "publicationYear": 2000, "description": "A novella that follows the 19th-century German painter Johann Moritz Rugendas on a journey through Argentina." },
    { "label": "Roberto Bolaño", "type": "author", "description": "A Chilean novelist, short-story writer, poet and essayist." },
    { "label": "2666", "type": "book", "publicationYear": 2004, "description": "An epic novel divided into five parts, centered around the unsolved murders of women in a fictional city in Mexico." },
    { "label": "Samantha Schweblin", "type": "author", "description": "An Argentine author known for her unsettling and surreal short stories and novels." },
    { "label": "Fever Dream", "type": "book", "publicationYear": 2014, "description": "A psychological horror novel about a young woman dying in a rural hospital clinic." },
    { "label": "Mariana Enríquez", "type": "author", "description": "An Argentine journalist and writer." },
    { "label": "Things We Lost in the Fire", "type": "book", "publicationYear": 2016, "description": "A collection of short stories that combine horror and magical realism to explore the dark side of Argentine history." },
    { "label": "Yuri Herrera", "type": "author", "description": "A Mexican writer." },
    { "label": "Signs Preceding the End of the World", "type": "book", "publicationYear": 2009, "description": "A novel about a young woman who crosses the border from Mexico to the United States to find her brother." },
    { "label": "Magical Realism", "type": "theme", "description": "A style of fiction that paints a realistic view of the modern world while also adding magical elements." },
    { "label": "Postcolonialism", "type": "theme", "description": "The historical period or state of affairs representing the aftermath of Western colonialism." },
    { "label": "Family Saga", "type": "theme", "description": "A genre of literature which chronicles the lives and doings of a family or a number of related or interconnected families over a period of time." },
    { "label": "The Supernatural Mundane", "type": "theme", "description": "A literary device where fantastical, strange, and magical events are treated as ordinary and commonplace." },
    { "label": "Political Allegory", "type": "theme", "description": "A narrative that serves as an extended metaphor in which persons, abstract ideas, or events represent not only themselves on the literal level, but they also stand for something else on the symbolic level." },
    { "label": "Myth & Folklore", "type": "theme", "description": "The use of traditional stories, myths, and legends within a modern narrative framework." },
    { "label": "Surrealism", "type": "theme", "description": "A cultural movement which developed in Europe in the aftermath of World War I and was largely influenced by Dada." },
    { "label": "Identity", "type": "theme", "description": "The exploration of selfhood, culture, and belonging, often in a shifting, fantastical world." },
    { "label": "History & Memory", "type": "theme", "description": "The exploration of how personal and collective pasts are remembered, distorted, and retold." },
    { "label": "Metamorphosis", "type": "theme", "description": "A change of the form or nature of a thing or person into a completely different one, by natural or supernatural means." },
    { "label": "Latin American Boom", "type": "theme", "description": "A literary movement of the 1960s and 1970s when the work of a group of relatively young Latin American novelists became widely circulated in Europe and throughout the world." },
    { "label": "Feminism", "type": "theme", "description": "The advocacy of women's rights on the basis of the equality of the sexes, often explored through magical or surreal narratives." },
    { "label": "New Weird", "type": "theme", "description": "A literary genre that emerged in the 1990s, which combines elements of science fiction, fantasy, and horror." }
  ],
  "edges": [
    {"source": "Gabriel García Márquez", "target": "One Hundred Years of Solitude"},
    {"source": "Isabel Allende", "target": "The House of the Spirits"},
    {"source": "Salman Rushdie", "target": "Midnight's Children"},
    {"source": "Haruki Murakami", "target": "Kafka on the Shore"},
    {"source": "Jorge Luis Borges", "target": "Ficciones"},
    {"source": "Laura Esquivel", "target": "Like Water for Chocolate"},
    {"source": "Toni Morrison", "target": "Beloved"},
    {"source": "Julio Cortázar", "target": "Hopscotch"},
    {"source": "Günter Grass", "target": "The Tin Drum"},
    {"source": "Angela Carter", "target": "Nights at the Circus"},
    {"source": "Mikhail Bulgakov", "target": "The Master and Margarita"},
    {"source": "Alejo Carpentier", "target": "The Kingdom of this World"},
    {"source": "Miguel Ángel Asturias", "target": "Men of Maize"},
    {"source": "Ben Okri", "target": "The Famished Road"},
    {"source": "Yasunari Kawabata", "target": "Palm-of-the-Hand Stories"},
    {"source": "Milan Kundera", "target": "The Unbearable Lightness of Being"},
    {"source": "Mo Yan", "target": "Red Sorghum"},
    {"source": "Italo Calvino", "target": "Invisible Cities"},
    {"source": "Alice Hoffman", "target": "Practical Magic"},
    {"source": "Sarah Addison Allen", "target": "Garden Spells"},
    {"source": "Aimee Bender", "target": "The Particular Sadness of Lemon Cake"},
    {"source": "Helen Oyeyemi", "target": "Boy, Snow, Bird"},
    {"source": "Nnedi Okorafor", "target": "Who Fears Death"},
    {"source": "Kelly Link", "target": "Get in Trouble"},
    {"source": "Carmen Maria Machado", "target": "Her Body and Other Parties"},
    {"source": "Kazuo Ishiguro", "target": "The Buried Giant"},
    {"source": "Lesley Nneka Arimah", "target": "What It Means When a Man Falls from the Sky"},
    {"source": "Silvia Moreno-Garcia", "target": "Mexican Gothic"},
    {"source": "Jeanette Winterson", "target": "The Passion"},
    {"source": "Erin Morgenstern", "target": "The Night Circus"},
    {"source": "Tea Obreht", "target": "The Tiger's Wife"},
    {"source": "Yoko Ogawa", "target": "The Housekeeper and the Professor"},
    {"source": "Patrick Süskind", "target": "Perfume: The Story of a Murderer"},
    {"source": "Jonathan Safran Foer", "target": "Everything Is Illuminated"},
    {"source": "Mark Helprin", "target": "Winter's Tale"},
    {"source": "Karen Russell", "target": "Swamplandia!"},
    {"source": "China Miéville", "target": "Perdido Street Station"},
    {"source": "Jeff VanderMeer", "target": "Annihilation"},
    {"source": "Neil Gaiman", "target": "American Gods"},
    {"source": "Susanna Clarke", "target": "Jonathan Strange & Mr Norrell"},
    {"source": "N. K. Jemisin", "target": "The Fifth Season"},
    {"source": "Ursula K. Le Guin", "target": "A Wizard of Earthsea"},
    {"source": "Carlos Fuentes", "target": "The Death of Artemio Cruz"},
    {"source": "Mario Vargas Llosa", "target": "Aunt Julia and the Scriptwriter"},
    {"source": "José Saramago", "target": "Blindness"},
    {"source": "W. G. Sebald", "target": "The Emigrants"},
    {"source": "Olga Tokarczuk", "target": "Flights"},
    {"source": "Juan Rulfo", "target": "Pedro Páramo"},
    {"source": "Clarice Lispector", "target": "The Hour of the Star"},
    {"source": "Ngũgĩ wa Thiong'o", "target": "Wizard of the Crow"},
    {"source": "Amos Tutuola", "target": "The Palm-Wine Drinkard"},
    {"source": "Ismail Kadare", "target": "The Palace of Dreams"},
    {"source": "William Faulkner", "target": "As I Lay Dying"},
    {"source": "Eowyn Ivey", "target": "The Snow Child"},
    {"source": "Alix E. Harrow", "target": "The Ten Thousand Doors of January"},
    {"source": "Shaun Tan", "target": "The Arrival"},
    {"source": "Andrei Bely", "target": "Petersburg"},
    {"source": "Alfred Kubin", "target": "The Other Side"},
    {"source": "Leonora Carrington", "target": "The Hearing Trumpet"},
    {"source": "Zakes Mda", "target": "Ways of Dying"},
    {"source": "Kōbō Abe", "target": "The Woman in the Dunes"},
    {"source": "José Donoso", "target": "The Obscene Bird of Night"},
    {"source": "Adolfo Bioy Casares", "target": "The Invention of Morel"},
    {"source": "César Aira", "target": "An Episode in the Life of a Landscape Painter"},
    {"source": "Roberto Bolaño", "target": "2666"},
    {"source": "Samantha Schweblin", "target": "Fever Dream"},
    {"source": "Mariana Enríquez", "target": "Things We Lost in the Fire"},
    {"source": "Yuri Herrera", "target": "Signs Preceding the End of the World"},
    {"source": "One Hundred Years of Solitude", "target": "Magical Realism"},
    {"source": "The House of the Spirits", "target": "Magical Realism"},
    {"source": "Midnight's Children", "target": "Magical Realism"},
    {"source": "Kafka on the Shore", "target": "Magical Realism"},
    {"source": "Like Water for Chocolate", "target": "Magical Realism"},
    {"source": "Beloved", "target": "Magical Realism"},
    {"source": "The Tin Drum", "target": "Magical Realism"},
    {"source": "Nights at the Circus", "target": "Magical Realism"},
    {"source": "The Master and Margarita", "target": "Magical Realism"},
    {"source": "The Kingdom of this World", "target": "Magical Realism"},
    {"source": "Men of Maize", "target": "Magical Realism"},
    {"source": "The Famished Road", "target": "Magical Realism"},
    {"source": "Practical Magic", "target": "Magical Realism"},
    {"source": "Garden Spells", "target": "Magical Realism"},
    {"source": "The Particular Sadness of Lemon Cake", "target": "Magical Realism"},
    {"source": "Boy, Snow, Bird", "target": "Magical Realism"},
    {"source": "Who Fears Death", "target": "Magical Realism"},
    {"source": "Get in Trouble", "target": "Magical Realism"},
    {"source": "Her Body and Other Parties", "target": "Magical Realism"},
    {"source": "The Buried Giant", "target": "Magical Realism"},
    {"source": "What It Means When a Man Falls from the Sky", "target": "Magical Realism"},
    {"source": "Mexican Gothic", "target": "Magical Realism"},
    {"source": "The Passion", "target": "Magical Realism"},
    {"source": "The Night Circus", "target": "Magical Realism"},
    {"source": "The Tiger's Wife", "target": "Magical Realism"},
    {"source": "Winter's Tale", "target": "Magical Realism"},
    {"source": "Swamplandia!", "target": "Magical Realism"},
    {"source": "American Gods", "target": "Magical Realism"},
    {"source": "Jonathan Strange & Mr Norrell", "target": "Magical Realism"},
    {"source": "The Fifth Season", "target": "Magical Realism"},
    {"source": "A Wizard of Earthsea", "target": "Magical Realism"},
    {"source": "The Snow Child", "target": "Magical Realism"},
    {"source": "The Ten Thousand Doors of January", "target": "Magical Realism"},
    {"source": "One Hundred Years of Solitude", "target": "Family Saga"},
    {"source": "The House of the Spirits", "target": "Family Saga"},
    {"source": "Red Sorghum", "target": "Family Saga"},
    {"source": "Beloved", "target": "History & Memory"},
    {"source": "Midnight's Children", "target": "History & Memory"},
    {"source": "The Buried Giant", "target": "History & Memory"},
    {"source": "The Emigrants", "target": "History & Memory"},
    {"source": "The Kingdom of this World", "target": "History & Memory"},
    {"source": "Midnight's Children", "target": "Postcolonialism"},
    {"source": "The Famished Road", "target": "Postcolonialism"},
    {"source": "Who Fears Death", "target": "Postcolonialism"},
    {"source": "Wizard of the Crow", "target": "Postcolonialism"},
    {"source": "Men of Maize", "target": "Myth & Folklore"},
    {"source": "The Tiger's Wife", "target": "Myth & Folklore"},
    {"source": "American Gods", "target": "Myth & Folklore"},
    {"source": "The Palm-Wine Drinkard", "target": "Myth & Folklore"},
    {"source": "Kafka on the Shore", "target": "The Supernatural Mundane"},
    {"source": "The Particular Sadness of Lemon Cake", "target": "The Supernatural Mundane"},
    {"source": "The Master and Margarita", "target": "Political Allegory"},
    {"source": "The Tin Drum", "target": "Political Allegory"},
    {"source": "Blindness", "target": "Political Allegory"},
    {"source": "The Palace of Dreams", "target": "Political Allegory"},
    {"source": "Ficciones", "target": "Surrealism"},
    {"source": "Invisible Cities", "target": "Surrealism"},
    {"source": "The Hearing Trumpet", "target": "Surrealism"},
    {"source": "The Woman in the Dunes", "target": "Surrealism"},
    {"source": "Her Body and Other Parties", "target": "Feminism"},
    {"source": "Nights at the Circus", "target": "Feminism"},
    {"source": "Boy, Snow, Bird", "target": "Identity"},
    {"source": "The Hour of the Star", "target": "Identity"},
    {"source": "Hopscotch", "target": "Identity"},
    {"source": "Perdido Street Station", "target": "New Weird"},
    {"source": "Annihilation", "target": "New Weird"},
    {"source": "Latin American Boom", "target": "Gabriel García Márquez"},
    {"source": "Latin American Boom", "target": "Julio Cortázar"},
    {"source": "Latin American Boom", "target": "Carlos Fuentes"},
    {"source": "Latin American Boom", "target": "Mario Vargas Llosa"},
    {"source": "Latin American Boom", "target": "José Donoso"},
    {"source": "Gabriel García Márquez", "target": "Isabel Allende"},
    {"source": "Jorge Luis Borges", "target": "Italo Calvino"},
    {"source": "Angela Carter", "target": "Helen Oyeyemi"},
    {"source": "Toni Morrison", "target": "N. K. Jemisin"},
    {"source": "Haruki Murakami", "target": "Yoko Ogawa"},
    {"source": "China Miéville", "target": "Jeff VanderMeer"},
    {"source": "Ursula K. Le Guin", "target": "Neil Gaiman"}
  ],
  "commentary": "Explore the enchanting world of Magical Realism, where the mundane and the miraculous intertwine."
}
